#taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

#brew package installation
brew 'gcc@8'
brew 'gdb'
brew 'python'
brew 'python3'
brew 'thefuck'
brew 'zsh'
brew 'zsh-completions'
brew 'wget'
brew 'git', link: false
brew 'git-lfs'
brew 'gnuplot'
brew 'htop'
brew 'tree'
brew 'mas'
brew "gnuplot", args: ["with-aquaterm"]
brew 'curl'
brew 'node'
brew 'vim'
brew 'cmake'
brew 'curl'
brew 'lua'
brew 'ncurses'
brew 'gh'
brew 'carthage'
brew 'qt'
brew 'ruby'
brew 'sqlite'

#cask installations
cask 'xquartz'
cask 'android-platform-tools'
cask 'google-chrome'
cask 'visual-studio-code'
cask 'vlc'
cask 'java'
cask 'spotify'
cask 'spotmenu'
cask 'java'
cask 'transmission'
cask 'raindropio'
cask 'rocket'
cask 'airbuddy'
cask 'ogdesign-eagle'
cask 'hey'
cask 'vnc-viewer'
cask 'bartender'
cask 'rectangle'
cask 'bettertouchtool'
cask 'choosy'
cask 'affinity-designer'
cask 'figma'
cask 'warp'
cask 'lunar'
cask 'contexts'
cask 'visual-studio-code'
cask 'notion'
cask 'cron'
cask 'raycast'
cask 'zoom'
cask 'clay'
cask '1password
'
#Mac App store apps
mas 'The Unarchiver', id: 425424353 
mas 'Slack', id: 803453959 
mas 'WhatsApp', id: 1147396723 
mas 'Amphetamine', id: 937984704 
mas 'Transmit', id: 1436522307 
mas 'Shazam', id: 897118787 
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Tot', id: 1491071483
mas 'JSONPeep', id: 1458969831
mas 'Microsoft Excel', id: 46205843
mas 'Microsoft PowerPoint', id: 462062816
mas 'Microsoft Word', id: 462054704
mas 'Twitter', id: 1482454543
mas 'Toast', id: 1465707487
mas 'iMovie', id: 408981434
mas 'overcast', id:888422857
mas 'Xcode', id:497799835
mas 'things-3', id:904280696
mas 'wipr', id:1320666476
mas 'plug', id:1514182074
mas 'unsplash', id:1284863847
mas 'testflight', id:899247664


#things to add
# screen studio
# Sleeve
# arc browser
# logi options +