#taps
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'

#brew package installation
brew 'java'
brew 'python'
brew 'python3'
brew 'thefuck'
brew 'zsh'
brew 'zsh-completions'
brew 'wget'
brew 'git', link: false
brew 'git-lfs'
brew 'gnuplot'
brew 'htop'
brew 'tree'
brew 'mas'
brew "gnuplot", args: ["with-aquaterm"]
brew 'curl'
brew 'node'
brew 'vim'
brew 'cmake'
brew 'curl'
brew 'lua'
brew 'ncurses'
brew 'gh'
brew 'carthage'
brew 'qt'
brew 'ruby'
brew 'sqlite'
brew 'brotli'
brew 'git'
brew 'rust'
brew 'fx'
brew 'imageoptim-cli'
brew 'coreutils'
brew 'moreutils'
brew 'findutils'

#cask installations
cask 'xquartz'
cask 'android-platform-tools'
cask 'vlc'
cask 'spotify'
cask 'transmission'
cask 'raindropio'
cask 'rocket'
cask 'airbuddy'
cask 'ogdesign-eagle'
cask 'vnc-viewer'
cask 'bartender'
cask 'bettertouchtool'
cask 'choosy'
cask 'affinity-designer'
cask 'figma'
cask 'warp'
cask 'lunar'
cask 'contexts'
cask 'visual-studio-code'
cask 'notion'
cask 'cron'
cask 'raycast'
cask 'zoom'
cask '1password'
cask 'framer'
cask 'logi-options-plus'
cask 'arc'
cask 'screen-studio'
cask 'keyclu'
cask 'bike'
cask 'typeface'
cask 'android-studio'
cask 'blender'
cask 'opal-composer'
cask 'origami-studio'
cask 'rive'
cask 'spline'
cask 'postman'
cask 'google-chrome'
cask 'bezel'
cask 'playcover-community'
cask 'lm-studio'
cask 'sf-symbols'
cask 'raspberry-pi-imager'
cask 'cloudytabs'
cask 'steam'
cask 'itsycal'
cask 'karabiner-elements'
cask 'cleanshot'
cask 'whatsapp'
cask 'plex-media-server'
cask 'jdownloader'
cask 'jordanbaird-ice'
cask 'craft'


#Mac App store apps
mas 'The Unarchiver', id: 425424353
mas 'Slack', id: 803453959
mas 'Amphetamine', id: 937984704
mas 'Transmit', id: 1436522307
mas 'Shazam', id: 897118787
mas 'Unsplash Wallpapers', id: 1284863847
mas 'Tot', id: 1491071483
mas 'JSONPeep', id: 1458969831
mas 'iMovie', id: 408981434
mas 'Xcode', id:497799835
mas 'things-3', id:904280696
mas 'wipr', id:1320666476
mas 'plug', id:1514182074
mas 'unsplash', id:1284863847
mas 'testflight', id:899247664
mas 'Bear Markdown Notes', id:1091189122
mas 'Perplexity', id:1875466942


#things to add
# Sleeve
# obinskit
# aseprite
# homerow
