1password.op-vscode
alefragnani.project-manager
anysphere.cursorpyright
apvarun.celestial
astro-build.astro-vscode
aykutsarac.jsoncrack-vscode
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
ecmel.vscode-html-css
esbenp.prettier-vscode
formulahendry.code-runner
idleberg.applescript
idleberg.jxa
ionutvmi.path-autocomplete
mikestead.dotenv
ms-python.debugpy
ms-python.isort
ms-python.python
nash.awesome-flutter-snippets
pkief.material-icon-theme
sumneko.lua
tomoki1207.pdf
wicked-labs.wvsc-serendipity
