1password.op-vscode
alefragnani.project-manager
apvarun.celestial
astro-build.astro-vscode
atelierbram.atelier-vscode-themes
austenc.tailwind-docs
aykutsarac.jsoncrack-vscode
bradlc.vscode-tailwindcss
christian-kohler.npm-intellisense
christian-kohler.path-intellisense
dart-code.dart-code
dart-code.flutter
dbaeumer.vscode-eslint
dsznajder.es7-react-js-snippets
ecmel.vscode-html-css
eliverlara.andromeda
esbenp.prettier-vscode
figma.figma-vscode-extension
formulahendry.code-runner
formulahendry.terminal
github.remotehub
heybourn.headwind
idleberg.applescript
ionutvmi.path-autocomplete
mikestead.dotenv
ms-python.debugpy
ms-python.isort
ms-python.python
ms-vscode.cpptools
ms-vscode.remote-repositories
nash.awesome-flutter-snippets
openai.openai-chatgpt-adhoc
oscarcs.dart-syntax-highlighting-only
pkief.material-icon-theme
seansassenrath.vscode-theme-superonedark
stripe.markdoc-language-support
sumneko.lua
tomoki1207.pdf
visualstudioexptteam.intellicode-api-usage-examples
visualstudioexptteam.vscodeintellicode
wicked-labs.wvsc-serendipity
